app/views/application/home_page/_most_popular_stores.html.haml


                  = link_to "#{merchant_name}", merchant.advertiser_url, :id => "merchant_popup_#{merchant.advertiser_id}", :class => "mpc_link", :onclick => "generate_popup(this.id, #{merchant.advertiser_id}, #{merchant.coupons.blank?}); return false;"
---
SELECT `pj_advertisers`.* FROM `pj_advertisers` WHERE (name LIKE 'Hotwire') LIMIT 1