app/controllers/application_controller.rb

  def index
    agent = UserAgent.parse request.env['HTTP_USER_AGENT']
    if /Android|webOS|iPhone|iPad|iPod|BlackBerry|IEMobile|Opera Mini/i.match(agent)
      #redirect_to google_search_path and return
    end
    @browser = :unknown
    case agent.browser
      when 'Safari' then @browser = :safari
      when 'Internet Explorer' then @browser = :ie
      when 'Chrome' then @browser = :chrome
      when 'Firefox' then @browser = :firefox
    end
    #HOME PAGE CONTENT
    all_pc = []
    selected_pc = []
#    ProductCategory::MPS.map{|cname| get_product_categories(cname).map{ |pcs| all_pc.push(pcs)}}
    ProductCategory::PCS.map{|cname| get_product_categories(cname).map{ |pcs| selected_pc.push(pcs)}}
---
SELECT `product_categories`.* FROM `product_categories` WHERE (name LIKE '%Accessories%')