app/controllers/search_controller.rb

INSERT INTO `search_intents` (`created_at`, `has_active_service_merchants`, `search`, `search_date`, `status`, `updated_at`, `user_earnings`, `user_id`) VALUES ('2015-02-25 07:44:16', 0, '', '2015-02-25', NULL, '2015-02-25 07:44:16', NULL, NULL)
SELECT `avant_advertisers`.* FROM `avant_advertisers` WHERE ((`avant_advertisers`.`inactive` IN (0) OR `avant_advertisers`.`inactive` IS NULL)) AND (name LIKE ('%%'))
SELECT `pj_advertisers`.* FROM `pj_advertisers` WHERE ((`pj_advertisers`.`inactive` IN (0) OR `pj_advertisers`.`inactive` IS NULL)) AND (name LIKE ('%%'))
SELECT `linkshare_advertisers`.* FROM `linkshare_advertisers` WHERE ((`linkshare_advertisers`.`inactive` IN (0) OR `linkshare_advertisers`.`inactive` IS NULL)) AND (name LIKE ('%%'))
---
  def hp_merchants_search
     @results = []
     search = params[:search_by_merchants].strip
     search = search.downcase.gsub(/[!@%'s'S&-,";]/,'')
     begin
      if current_user.present?
        search_intent = Search::Intent.find_or_create_by_search_and_user_id_and_search_date(search, current_user.id, Date.today)
     else
       search_intent = Search::Intent.find_or_create_by_search_and_search_date(search, Date.today)

      end
    rescue ActiveRecord::RecordNotUnique
      render :json => [] and return
    end
    @results = []
    @product_results_cj = []
    @product_results_pj = []
    @product_results_ir = []
    @product_results_avant = []
    avant = AvantAdvertiser.where('inactive != 1 and LOWER(name) LIKE ?', "%#{search}%").first
    cj = CjAdvertiser.where('inactive != 1 and LOWER(name) LIKE ?', "%#{search}%").first
    linkshare = LinkshareAdvertiser.where('inactive != 1 and LOWER(name) LIKE ?', "%#{search}%").first